# Tidying

In [1]:
import pandas as pd

In [17]:
df = pd.DataFrame({'student_id': {0: 'a', 1: 'b', 2: 'c'},
                   'arabic': {0: 1, 1: None, 2: 5},
                   'english': {0: 2, 1: 4, 2: 6},
                   'french': {0: 3, 1: 4, 2: 5}})

In [18]:
df

  student_id  arabic  english  french
0          a     1.0        2       3
1          b     NaN        4       4
2          c     5.0        6       5

### wide to long data use pandas `melt`

In [19]:
cleanDf = pd.melt(df,id_vars="student_id",value_vars=["arabic","english","french"])

In [20]:
cleanDf

  student_id variable  value
0          a   arabic    1.0
1          b   arabic    NaN
2          c   arabic    5.0
3          a  english    2.0
4          b  english    4.0
5          c  english    6.0
6          a   french    3.0
7          b   french    4.0
8          c   french    5.0

In [21]:
cleanDf.rename(columns={"variable":"subject_name","value":"grade"},inplace=True)

In [22]:
cleanDf

  student_id subject_name  grade
0          a       arabic    1.0
1          b       arabic    NaN
2          c       arabic    5.0
3          a      english    2.0
4          b      english    4.0
5          c      english    6.0
6          a       french    3.0
7          b       french    4.0
8          c       french    5.0

In [23]:
cleanDf = cleanDf[cleanDf["grade"].notna()]

In [24]:
cleanDf

  student_id subject_name  grade
0          a       arabic    1.0
2          c       arabic    5.0
3          a      english    2.0
4          b      english    4.0
5          c      english    6.0
6          a       french    3.0
7          b       french    4.0
8          c       french    5.0

In [26]:
#how many subjects per student
cleanDf["student_id"].value_counts()

c    3
a    3
b    2
Name: student_id, dtype: int64

In [29]:
#mean grades per students
mean_geades_per_student = cleanDf.groupby("student_id")["grade"].mean()
mean_geades_per_student

student_id
a    2.000000
b    4.000000
c    5.333333
Name: grade, dtype: float64

In [31]:
#min grade per each subject
#max grade per each subject

min_geades_per_subject = cleanDf.groupby("subject_name")["grade"].min()
min_geades_per_subject

subject_name
arabic     1.0
english    2.0
french     3.0
Name: grade, dtype: float64

In [32]:
max_geades_per_subject  =  cleanDf.groupby("subject_name")["grade"].max()
max_geades_per_subject

subject_name
arabic     5.0
english    6.0
french     5.0
Name: grade, dtype: float64

In [34]:
min_max_grade_per_sub = cleanDf.groupby("subject_name").agg({"grade":['min','max']}).reset_index()
min_max_grade_per_sub

  subject_name grade
                 min  max
0       arabic   1.0  5.0
1      english   2.0  6.0
2       french   3.0  5.0

In [ ]:
df = pd.DataFrame({'student_id': {0: 'a', 1: 'b', 2: 'c'},
                   'class_a': {0: 1, 1: 3, 2: 5},
                   'class_b': {0: 2, 1: 4, 2: 6}})

  student_id  class_a  class_b
0          a        1        2
1          b        3        4
2          c        5        6

In [2]:
pc = pd.read_csv('data/tidy/average_arrival_delay.csv')
pc.head(3)

  airline  ATL   DEN  DFW   IAH   LAS  LAX  MSP   ORD   PHX  SFO
0      AA  4.0   9.0  5.0  11.0   8.0  3.0  1.0   8.0   5.0  3.0
1      AS  6.0  -3.0 -5.0   1.0   2.0 -3.0  6.0   2.0  -9.0  4.0
2      B6  NaN  12.0  4.0   NaN  11.0  2.0  NaN  23.0  20.0  5.0

### Exercises:

In [35]:
# convert wide table to long table with three columns ["airline","company_name","ave_delay"]

In [ ]:
# drop missing rows

In [36]:
#calculate max,min delay per company_name

In [37]:
#calculate max,min delay per airline